tutorials/multiphase/settlingFoam/tank3D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;
        tolerance        1e-07;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-07;
        relTol           0;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-07;
        relTol           0;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-07;
        relTol           0;
    }
    rho
    {}
    Alpha
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-07;
        relTol           0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
